Config/AccumulationRegisters/ПрослеживаемыеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПрослеживаемыеОС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрослеживаемости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОбъектовОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РНПТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектующее</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураПрослеживаемость</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/AccumulationRegisters/ПрослеживаемыеОС/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "КонтрольОстатковПослеПроведения", Ложь) Тогда
		
		БлокироватьДляИзменения = Истина;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерТаблицИзмененияРегистров;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Период КАК Период,
		|	Таблица.ВидДвижения КАК ВидДвижения,
		|	Таблица.Организация КАК Организация,
		|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
		|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
		|	Таблица.РНПТ КАК РНПТ,
		|	Таблица.Комплектующее КАК Комплектующее,
		|	Таблица.Количество КАК Количество
		|ПОМЕСТИТЬ ДвиженияПрослеживаемыеОСПередЗаписью
		|ИЗ
		|	РегистрНакопления.ПрослеживаемыеОС КАК Таблица
		|ГДЕ
		|	Таблица.Регистратор = &Регистратор";
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.Выполнить();

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	ДополнительныеСвойства.Вставить("КонтрольИзмененийПриЗаписи", Ложь);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "КонтрольОстатковПослеПроведения", Ложь) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Таблица.Период КАК Период,
		|	Таблица.Организация КАК Организация,
		|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
		|	Таблица.РНПТ КАК РНПТ,
		|	Таблица.Комплектующее КАК Комплектующее,
		|	СУММА(Таблица.Количество) КАК Количество,
		|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения
		|ПОМЕСТИТЬ ПрослеживаемыеОСИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|		Таблица.Период КАК Период,
		|		Таблица.ВидДвижения КАК ВидДвижения,
		|		Таблица.Организация КАК Организация,
		|		Таблица.ОсновноеСредство КАК ОсновноеСредство,
		|		Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
		|		Таблица.РНПТ КАК РНПТ,
		|		Таблица.Комплектующее КАК Комплектующее,
		|		ВЫБОР
		|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Таблица.Количество
		|			ИНАЧЕ -Таблица.Количество
		|		КОНЕЦ КАК Количество
		|	ИЗ
		|		ДвиженияПрослеживаемыеОСПередЗаписью КАК Таблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Таблица.Период,
		|		Таблица.ВидДвижения,
		|		Таблица.Организация,
		|		Таблица.ОсновноеСредство,
		|		Таблица.СтранаПроисхождения,
		|		Таблица.РНПТ,
		|		Таблица.Комплектующее,
		|		ВЫБОР
		|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -Таблица.Количество
		|			ИНАЧЕ Таблица.Количество
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ПрослеживаемыеОС КАК Таблица
		|	ГДЕ
		|		Таблица.Регистратор = &Регистратор) КАК Таблица
		|
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Организация,
		|	Таблица.ОсновноеСредство,
		|	Таблица.РНПТ,
		|	Таблица.Комплектующее,
		|	Таблица.Период,
		|	Таблица.СтранаПроисхождения
		|
		|ИМЕЮЩИЕ
		|	СУММА(Таблица.Количество) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДвиженияПрослеживаемыеОСПередЗаписью");
		
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерТаблицИзмененияРегистров;
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		
		Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		
		ДополнительныеСвойства.КонтрольИзмененийПриЗаписи = Результат[0].Выбрать().Следующий();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
